#### MultiReferenceAnnotationOptions Members

---

|  |
| --- |
| MultiReferenceAnnotationOptions Class   Constructors   Methods   Properties   See Also |

The  MultiReferenceAnnotationOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | MultiReferenceAnnotationOptions | Create an instance of Multi-Reference Annotation Options set with default values. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  MultiReferenceAnnotationOptions |
| Public method | ElementsMatchReferenceCategory | Verifies that all of the elements match the reference category required by the MultiReferenceAnnotationType. |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAdditionalReferencesToDimension | Gets the additional references which the dimension will witness. |
| Public method | GetElementsToDimension | Gets the elements which the dimension will witness. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsAllowedDimensionStyleType | Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations. |
| Public method | ReferencesDontMatchReferenceCategory | Verifies that all of the references belongs to elements which doesn't match the reference category required by the MultiReferenceAnnotationType. |
| Public method | SetAdditionalReferencesToDimension | Sets the additional references which the dimension will witness. |
| Public method | SetElementsToDimension | Sets the elements which the dimension will witness. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DimensionLineDirection | The direction vector of the dimension line. |
| Public property | DimensionLineOrigin | The origin point for the dimension line. |
| Public property | DimensionPlaneNormal | The normal vector to the dimension plane. |
| Public property | DimensionStyleType | The dimension style type to be used by the new MultiReferenceAnnotation. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MultiReferenceAnnotationType | The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation. |
| Public property | TagHasLeader | When true the tag will be created with an attached leader. When false the tag will be created without a leader. |
| Public property | TagHeadPosition | The position for the tag's head. |

# See Also

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace